dicom/app/controllers/examinations_controller.rb

SELECT "examinations".* FROM "examinations"
SELECT AVG("examinations"."exposure") AS avg_id FROM "examinations" WHERE (study == 'Cardiovascular^Heart-Cardiac Function')
---
  def index
    @examinations = Examination.find(:all)
    @study = params[:study]
    @mean_exposure = Examination.average(:exposure, :conditions => ['study == ?', @study]) if @study

SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_examination
      @examination = Examination.find(params[:id])